app/admin/stores.rb

SELECT "users".* FROM "users" WHERE "users"."seller_role" = ?  [["seller_role", 1]]
---

    form do |f|
      f.inputs do
        f.input :user_id, as: :select, collection: User.where(seller_role: true).map