app/controllers/orders_controller.rb

SELECT "users"."id" FROM "users"
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" IN (?, ?)  [["user_id", 2], ["user_id", 1]]
---
  def index

    @user = User.all
    @orders = Order.where(user_id: current_user.id)

INSERT INTO "orders" ("orderstate", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["orderstate", "pending"], ["user_id", 4], ["created_at", "2020-05-09 15:04:16.425103"], ["updated_at", "2020-05-09 15:04:16.425103"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 4]]
---
  def create
    @order = Order.new(order_params)
    # @current_cart.line_items.each do |item|
    #   @order.line_items << item
    #   item.cart_id = nil
    # end

    @order.orderstate = "pending"
    # @order.user_id = 1 #current_user_id
    @order.user_id = current_user.id
    @order.save
    Cart.destroy(session[:cart_id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "orders" SET "orderstate" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["orderstate", "pending "], ["updated_at", "2020-05-08 17:15:14.194456"], ["id", 2]]
---
  def update
    @order = Order.find(params[:id])
    respond_to do |format|
      if @order.update(order_params)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @order = Order.find(params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def place
    @order = Order.find(params[:id])