app/controllers/products_controller.rb

  def index
    @products = Product.where(user_id: current_user.id)
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 1]]

  def create
    @product = Product.new(product_params)
    @product.user_id = current_user.id
    # @categories=Category.all

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "price", "instockquantity", "category_id", "brand_id", "created_at", "updated_at", "store_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2020-05-09 10:52:45.960956"], ["id", 1]]