app/controllers/stores_controller.rb

DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 8]]
---
  def destroy
    @store.destroy

SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_store
      @store = Store.find(params[:id])