app/views/products/_form.html.erb

    <%= form.label :category_id %>
    <%= form.select :category_id ,  Category.all.collect {|c| [c.id]} %>
---
SELECT "categories".* FROM "categories"

    <%= form.label :brand_id %>
    <%= form.select :brand_id ,  Brand.all.collect {|b| [b.id]} %>
---
SELECT "brands".* FROM "brands"

    <%= form.label :store_id %>
    <%= form.select :store_id ,  Store.all.collect {|s| [s.id]} %>
---
SELECT "stores".* FROM "stores"